backend/app/controllers/users_controller.rb

INSERT INTO "families" ("family_pin", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["family_pin", "test123"], ["created_at", "2020-05-01 22:06:50.357560"], ["updated_at", "2020-05-01 22:06:50.357560"]]
SELECT "families".* FROM "families" WHERE "families"."family_pin" = $1 LIMIT $2  [["family_pin", "Test123"], ["LIMIT", 1]]
INSERT INTO "users" ("firstname", "lastname", "email", "family_id", "created_at", "updated_at", "role", "username", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
DELETE FROM "families" WHERE "families"."id" = $1  [["id", 6]]
---
    def signup
        @families = Family.all
        # @family = Family.create({family_pin: "test123"})
        byebug
        if user_params[:family_id] == false
            @family = Family.create!({family_pin: "test123"})
            # user_params[:family_id] = @family.id
        else
            @family = @families.find_by!(family_pin: user_params[:family_id])
            # user_params[:family_id] = @family.id
        end

        @user = User.new(user_params)
            @user.family_id = @family.id
            byebug
            if @user.valid?
                @user.save
                render json: {user: UserSerializer.new(@user).as_json}, status: :created
            else
                errors_message = @user.errors.messages
                render json: {error: "Failed to create a user"}, status: :not_acceptable
                @family.destroy